Revit 2027 API
Space.SpaceType Property
Get or set the Space type of the Space.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SpaceType SpaceType { get; set; }
Public Property SpaceType As SpaceType
	Get
	Set
public:
property SpaceType SpaceType {
	SpaceType get ();
	void set (SpaceType value);
}
member SpaceType : SpaceType with get, set
Property Value
SpaceType
Remarks
This property is used to get or set the Space type of the Space.
See Also
Reference
Space Class
Autodesk.Revit.DB.Mechanical Namespace